Revit 2026 API

# SpatialElementGeometryResultsGetBoundaryFaceInfo Method

---

Query the spatial element boundary face information with the given face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<SpatialElementBoundarySubface> GetBoundaryFaceInfo(
	Face face
)
```
```vb
Public Function GetBoundaryFaceInfo (
	face As Face
) As IList(Of SpatialElementBoundarySubface)
```
```cpp
public:
IList<SpatialElementBoundarySubface^>^ GetBoundaryFaceInfo(
	Face^ face
)
```
```fsharp
member GetBoundaryFaceInfo :
        face : Face -> IList<SpatialElementBoundarySubface>
```

#### Parameters

face Face
     The face from the spatial element's geometry.

#### Return Value

IListSpatialElementBoundarySubface Sub-faces related to the room bounding elements that define the spatial element face. Returns  if there is no corresponding boundary information with the given face.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SpatialElementGeometryResults Class

Autodesk.Revit.DB Namespace